NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK81F25615.svd
        <register>
          <name>LTC0_PKA3_0</name>
          <description>LTC PKHA A3 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_48</name>
          <description>LTC PKHA A 48 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_1</name>
          <description>LTC PKHA A3 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_49</name>
          <description>LTC PKHA A 49 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_2</name>
          <description>LTC PKHA A3 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_50</name>
          <description>LTC PKHA A 50 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_3</name>
          <description>LTC PKHA A3 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_51</name>
          <description>LTC PKHA A 51 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_4</name>
          <description>LTC PKHA A3 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_52</name>
          <description>LTC PKHA A 52 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_5</name>
          <description>LTC PKHA A3 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_53</name>
          <description>LTC PKHA A 53 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_6</name>
          <description>LTC PKHA A3 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_54</name>
          <description>LTC PKHA A 54 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_7</name>
          <description>LTC PKHA A3 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_55</name>
          <description>LTC PKHA A 55 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_8</name>
          <description>LTC PKHA A3 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_56</name>
          <description>LTC PKHA A 56 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_9</name>
          <description>LTC PKHA A3 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_57</name>
          <description>LTC PKHA A 57 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_10</name>
          <description>LTC PKHA A3 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_58</name>
          <description>LTC PKHA A 58 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_11</name>
          <description>LTC PKHA A3 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_59</name>
          <description>LTC PKHA A 59 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_12</name>
          <description>LTC PKHA A3 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_60</name>
          <description>LTC PKHA A 60 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_13</name>
          <description>LTC PKHA A3 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_61</name>
          <description>LTC PKHA A 61 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_14</name>
          <description>LTC PKHA A3 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_62</name>
          <description>LTC PKHA A 62 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_15</name>
          <description>LTC PKHA A3 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_63</name>
          <description>LTC PKHA A 63 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_0</name>
          <description>LTC PKHA B0 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_0</name>
          <description>LTC PKHA B 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_1</name>
          <description>LTC PKHA B0 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_1</name>
          <description>LTC PKHA B 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_2</name>
          <description>LTC PKHA B0 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_2</name>
          <description>LTC PKHA B 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_3</name>
          <description>LTC PKHA B0 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_3</name>
          <description>LTC PKHA B 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_4</name>
          <description>LTC PKHA B0 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_4</name>
          <description>LTC PKHA B 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_5</name>
          <description>LTC PKHA B0 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_5</name>
          <description>LTC PKHA B 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_6</name>
          <description>LTC PKHA B0 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_6</name>
          <description>LTC PKHA B 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
