NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK81F25615.svd
        <register>
          <name>LTC0_PKB0_7</name>
          <description>LTC PKHA B0 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_7</name>
          <description>LTC PKHA B 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_8</name>
          <description>LTC PKHA B0 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_8</name>
          <description>LTC PKHA B 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_9</name>
          <description>LTC PKHA B0 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_9</name>
          <description>LTC PKHA B 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_10</name>
          <description>LTC PKHA B0 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_10</name>
          <description>LTC PKHA B 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_11</name>
          <description>LTC PKHA B0 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_11</name>
          <description>LTC PKHA B 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_12</name>
          <description>LTC PKHA B0 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_12</name>
          <description>LTC PKHA B 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_13</name>
          <description>LTC PKHA B0 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_13</name>
          <description>LTC PKHA B 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_14</name>
          <description>LTC PKHA B0 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_14</name>
          <description>LTC PKHA B 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB0_15</name>
          <description>LTC PKHA B0 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B0</name>
              <description>B0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_15</name>
          <description>LTC PKHA B 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_0</name>
          <description>LTC PKHA B1 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_16</name>
          <description>LTC PKHA B 16 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_1</name>
          <description>LTC PKHA B1 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_17</name>
          <description>LTC PKHA B 17 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_2</name>
          <description>LTC PKHA B1 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_18</name>
          <description>LTC PKHA B 18 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_3</name>
          <description>LTC PKHA B1 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_19</name>
          <description>LTC PKHA B 19 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_4</name>
          <description>LTC PKHA B1 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_20</name>
          <description>LTC PKHA B 20 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_5</name>
          <description>LTC PKHA B1 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_21</name>
          <description>LTC PKHA B 21 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_6</name>
          <description>LTC PKHA B1 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_22</name>
          <description>LTC PKHA B 22 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_7</name>
          <description>LTC PKHA B1 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_23</name>
          <description>LTC PKHA B 23 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_8</name>
          <description>LTC PKHA B1 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_24</name>
          <description>LTC PKHA B 24 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_9</name>
          <description>LTC PKHA B1 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_25</name>
          <description>LTC PKHA B 25 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_10</name>
          <description>LTC PKHA B1 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_26</name>
          <description>LTC PKHA B 26 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_11</name>
          <description>LTC PKHA B1 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_27</name>
          <description>LTC PKHA B 27 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_12</name>
          <description>LTC PKHA B1 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_28</name>
          <description>LTC PKHA B 28 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_13</name>
          <description>LTC PKHA B1 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_29</name>
          <description>LTC PKHA B 29 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
