NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK81F25615.svd
        <register>
          <name>LTC0_PKN0_12</name>
          <description>LTC PKHA N0 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_12</name>
          <description>LTC PKHA N 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_13</name>
          <description>LTC PKHA N0 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_13</name>
          <description>LTC PKHA N 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_14</name>
          <description>LTC PKHA N0 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_14</name>
          <description>LTC PKHA N 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_15</name>
          <description>LTC PKHA N0 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_15</name>
          <description>LTC PKHA N 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_0</name>
          <description>LTC PKHA N1 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_16</name>
          <description>LTC PKHA N 16 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_1</name>
          <description>LTC PKHA N1 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_17</name>
          <description>LTC PKHA N 17 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_2</name>
          <description>LTC PKHA N1 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_18</name>
          <description>LTC PKHA N 18 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_3</name>
          <description>LTC PKHA N1 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_19</name>
          <description>LTC PKHA N 19 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_4</name>
          <description>LTC PKHA N1 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_20</name>
          <description>LTC PKHA N 20 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_5</name>
          <description>LTC PKHA N1 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_21</name>
          <description>LTC PKHA N 21 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_6</name>
          <description>LTC PKHA N1 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_22</name>
          <description>LTC PKHA N 22 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_7</name>
          <description>LTC PKHA N1 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_23</name>
          <description>LTC PKHA N 23 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_8</name>
          <description>LTC PKHA N1 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_24</name>
          <description>LTC PKHA N 24 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_9</name>
          <description>LTC PKHA N1 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_25</name>
          <description>LTC PKHA N 25 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_10</name>
          <description>LTC PKHA N1 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_26</name>
          <description>LTC PKHA N 26 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_11</name>
          <description>LTC PKHA N1 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_27</name>
          <description>LTC PKHA N 27 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_12</name>
          <description>LTC PKHA N1 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_28</name>
          <description>LTC PKHA N 28 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_13</name>
          <description>LTC PKHA N1 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_29</name>
          <description>LTC PKHA N 29 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_14</name>
          <description>LTC PKHA N1 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_30</name>
          <description>LTC PKHA N 30 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN1_15</name>
          <description>LTC PKHA N1 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N1</name>
              <description>N1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_31</name>
          <description>LTC PKHA N 31 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_0</name>
          <description>LTC PKHA N2 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_32</name>
          <description>LTC PKHA N 32 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_1</name>
          <description>LTC PKHA N2 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_33</name>
          <description>LTC PKHA N 33 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_2</name>
          <description>LTC PKHA N2 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_34</name>
          <description>LTC PKHA N 34 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
