NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK81F25615.svd
        <register>
          <name>LTC0_PKE1_1</name>
          <description>LTC PKHA E1 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_17</name>
          <description>LTC PKHA E 17 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_2</name>
          <description>LTC PKHA E1 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_18</name>
          <description>LTC PKHA E 18 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_3</name>
          <description>LTC PKHA E1 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_19</name>
          <description>LTC PKHA E 19 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_4</name>
          <description>LTC PKHA E1 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_20</name>
          <description>LTC PKHA E 20 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_5</name>
          <description>LTC PKHA E1 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_21</name>
          <description>LTC PKHA E 21 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_6</name>
          <description>LTC PKHA E1 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_22</name>
          <description>LTC PKHA E 22 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_7</name>
          <description>LTC PKHA E1 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_23</name>
          <description>LTC PKHA E 23 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_8</name>
          <description>LTC PKHA E1 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_24</name>
          <description>LTC PKHA E 24 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_9</name>
          <description>LTC PKHA E1 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_25</name>
          <description>LTC PKHA E 25 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_10</name>
          <description>LTC PKHA E1 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_26</name>
          <description>LTC PKHA E 26 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_11</name>
          <description>LTC PKHA E1 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_27</name>
          <description>LTC PKHA E 27 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_12</name>
          <description>LTC PKHA E1 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_28</name>
          <description>LTC PKHA E 28 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_13</name>
          <description>LTC PKHA E1 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_29</name>
          <description>LTC PKHA E 29 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_14</name>
          <description>LTC PKHA E1 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_30</name>
          <description>LTC PKHA E 30 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_15</name>
          <description>LTC PKHA E1 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_31</name>
          <description>LTC PKHA E 31 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_0</name>
          <description>LTC PKHA E2 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_32</name>
          <description>LTC PKHA E 32 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_1</name>
          <description>LTC PKHA E2 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_33</name>
          <description>LTC PKHA E 33 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_2</name>
          <description>LTC PKHA E2 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_34</name>
          <description>LTC PKHA E 34 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_3</name>
          <description>LTC PKHA E2 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_35</name>
          <description>LTC PKHA E 35 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_4</name>
          <description>LTC PKHA E2 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_36</name>
          <description>LTC PKHA E 36 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_5</name>
          <description>LTC PKHA E2 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_37</name>
          <description>LTC PKHA E 37 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_6</name>
          <description>LTC PKHA E2 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_38</name>
          <description>LTC PKHA E 38 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_7</name>
          <description>LTC PKHA E2 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_39</name>
          <description>LTC PKHA E 39 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
