NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK81F25615.svd
        <register>
          <name>SOCCR</name>
          <description>SOC Configuration Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QSPISRC</name>
              <description>QSPI clock source select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Core/system clock</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>MCGFLL clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>MCGPLL clock</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>MCGPLL 2x clock (DDR mode specific)</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>IRC48M clock</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>OSCERCLK clock</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>MCGIRCLK clock</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSLPEN</name>
              <description>When this bit is set the internal generated DQS is selected and looped back to QuadSPI, without going to DQS pad. DQSPADLPEN should be cleared when this bit is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DQS loop back is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DQS loop back is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSPADLPEN</name>
              <description>When this bit is set the internal generated DQS will be sent to the DQS pad first and then looped back to QuadSPI. DQSLPEN should be cleared when this bit is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DQS loop back from DQS pad is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DQS loop back from DQS pad is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSPHASEL</name>
              <description>Select phase shift for internal DQS generation. These bits are always zero in SDR mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>No phase shift</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Select 45 degree phase shift</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Select 90 degree phase shift</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Select 135 degree phase shift</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSINVSEL</name>
              <description>Select clock source for internal DQS generation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Use 1x internal reference clock for the DQS generation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use inverse 1x internal reference clock for the DQS generation</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CK2EN</name>
              <description>Flash CK2 clock pin enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>CK2 flash clock is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CK2 flash clock is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFFCKEN</name>
              <description>Differential flash clock pins enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Differential flash clock is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Differential flash clock is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTEN</name>
              <description>Octal data pins enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>QSPI0B_DATAx pins are assigned to QSPI Port B</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>QSPI0B_DATAx pins are assigned to QSPI Port A</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLYTAPSELA</name>
              <description>Delay chain tap number selection for QSPI Port A DQS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>Select 1 delay chain tap</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001</name>
                  <description>Select 2 delay chain tap</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010</name>
                  <description>Select 3 delay chain tap</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011</name>
                  <description>Select 4 delay chain tap</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100</name>
                  <description>Select 5 delay chain tap</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101</name>
                  <description>Select 6 delay chain tap</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110</name>
                  <description>Select 7 delay chain tap</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111</name>
                  <description>Select 8 delay chain tap</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001000</name>
                  <description>Select 9 delay chain tap</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001001</name>
                  <description>Select 10 delay chain tap</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001010</name>
                  <description>Select 11 delay chain tap</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001011</name>
                  <description>Select 12 delay chain tap</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001100</name>
                  <description>Select 13 delay chain tap</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001101</name>
                  <description>Select 14 delay chain tap</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001110</name>
                  <description>Select 15 delay chain tap</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001111</name>
                  <description>Select 16 delay chain tap</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010000</name>
                  <description>Select 17 delay chain tap</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010001</name>
                  <description>Select 18 delay chain tap</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010010</name>
                  <description>Select 19 delay chain tap</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010011</name>
                  <description>Select 20 delay chain tap</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010100</name>
                  <description>Select 21 delay chain tap</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010101</name>
                  <description>Select 22 delay chain tap</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010110</name>
                  <description>Select 23 delay chain tap</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010111</name>
                  <description>Select 24 delay chain tap</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011000</name>
                  <description>Select 25 delay chain tap</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011001</name>
                  <description>Select 26 delay chain tap</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011010</name>
                  <description>Select 27 delay chain tap</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011011</name>
                  <description>Select 28 delay chain tap</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011100</name>
                  <description>Select 29 delay chain tap</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011101</name>
                  <description>Select 30 delay chain tap</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011110</name>
                  <description>Select 31 delay chain tap</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011111</name>
                  <description>Select 32 delay chain tap</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100000</name>
                  <description>Select 33 delay chain tap</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100001</name>
                  <description>Select 34 delay chain tap</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100010</name>
                  <description>Select 35 delay chain tap</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100011</name>
                  <description>Select 36 delay chain tap</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100100</name>
                  <description>Select 37 delay chain tap</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100101</name>
                  <description>Select 38 delay chain tap</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100110</name>
                  <description>Select 39 delay chain tap</description>
                  <value>#100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100111</name>
                  <description>Select 40 delay chain tap</description>
                  <value>#100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101000</name>
                  <description>Select 41 delay chain tap</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101001</name>
                  <description>Select 42 delay chain tap</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101010</name>
                  <description>Select 43 delay chain tap</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101011</name>
                  <description>Select 44 delay chain tap</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101100</name>
                  <description>Select 45 delay chain tap</description>
                  <value>#101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101101</name>
                  <description>Select 46 delay chain tap</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101110</name>
                  <description>Select 47 delay chain tap</description>
                  <value>#101110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101111</name>
                  <description>Select 48 delay chain tap</description>
                  <value>#101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110000</name>
                  <description>Select 49 delay chain tap</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110001</name>
                  <description>Select 50 delay chain tap</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110010</name>
                  <description>Select 51 delay chain tap</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110011</name>
                  <description>Select 52 delay chain tap</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110100</name>
                  <description>Select 53 delay chain tap</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110101</name>
                  <description>Select 54 delay chain tap</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110110</name>
                  <description>Select 55 delay chain tap</description>
                  <value>#110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110111</name>
                  <description>Select 56 delay chain tap</description>
                  <value>#110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111000</name>
                  <description>Select 57 delay chain tap</description>
                  <value>#111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111001</name>
                  <description>Select 58 delay chain tap</description>
                  <value>#111001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111010</name>
                  <description>Select 59 delay chain tap</description>
                  <value>#111010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111011</name>
                  <description>Select 60 delay chain tap</description>
                  <value>#111011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111100</name>
                  <description>Select 61 delay chain tap</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111101</name>
                  <description>Select 62 delay chain tap</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111110</name>
                  <description>Select 63 delay chain tap</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111111</name>
                  <description>Select 64 delay chain tap</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLYTAPSELB</name>
              <description>Delay chain tap number selection for QSPI Port B DQS</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>Select 1 delay chain tap</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001</name>
                  <description>Select 2 delay chain tap</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010</name>
                  <description>Select 3 delay chain tap</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011</name>
                  <description>Select 4 delay chain tap</description>
                  <value>#11</value>
                </enumeratedValue>
